In [1]:
 import pandas as pd
import numpy as np

In [2]:
##farklı yerlerden gelen aynı datadan farklı örneklerden oluşan verileri birleştirme

In [5]:
sozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep", "At1l"],
"Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"],
"Kalori" : [100,200,300,400]}

dataFrame1 = pd.DataFrame(sozluk1,index = [0,1,2,3])

In [11]:


sozluk2 = {"Isim" : ["Osman","Levent", "Atlas", "Fatma" ],
"Spor": ["Koşu", "Yüzme", "Koşu", "Basketbol"],
"Kalori": [200,100,50,300]
}

In [12]:
dataFrame2 = pd.DataFrame(sozluk2,index= [4,5,6,7])

In [13]:
sozluk3 = {"Isim" : ["Ayse","Mahmut","Duygu", "Nur" ],
"Spor" : ["Koşu", "Yüzme", "Badminton", "Tenis" ],
"Kalori" : [300,400,500,250]
}

In [10]:
dataFrame3 = pd.DataFrame(sozluk3,index=[8,9,10,11])

In [14]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    At1l  Basketbol     400

In [15]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [16]:
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250

##### concatenation birleştirme 
#### eğer formatları aynı tabloları birleştireceksek concat kullanılabilr

In [19]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0) ###axis 0 yazmasak da aynı sonucu verirdi ama axis 1  olabileceğini de hatırlatmak için yazdık

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     At1l  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayse       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     250